In [20]:
import pandas as pd

df_1 = pd.DataFrame(['a','b','c'],columns=['A'])
df_1

   A
0  a
1  b
2  c

In [21]:
df_1['B'] = ['A','B','C']
df_1

   A  B
0  a  A
1  b  B
2  c  C

In [22]:
df_1['B'] = [1,2,3]
df_1

#만일 추가되는 데이터가 리스트가 아닌 단일 데이터라면?
#해당 colum에 추가되는 데이터가 해당 단일 데이터로 통일된다.
df_1['B']='A'
df_1

   A  B
0  a  A
1  b  A
2  c  A

In [40]:
#colum의 value 추출
print(df_1['A'])
print(df_1.A)

0    a
1    b
2    c
Name: A, dtype: object
0    a
1    b
2    c
Name: A, dtype: object

In [6]:
#colum값 변경
df_1.columns = ['a','b']
df_1

   a  b
0  a  A
1  b  A
2  c  A

In [7]:
#sort함수-> 데이터 정렬
values = [['test1','2000'],['test2','30000'],['test3','1000']]
columns = ['name','pay']
df_2 = pd.DataFrame(values,columns=columns)
df_2

df_2.sort_values('pay') #sort: 정렬-> _values-> 해당 value의 columns 기준 ->디폴트: 오름차순 (내림차순: ascending = False 추가)
                        #          -> _index -> index 값 기준

    name    pay
2  test3   1000
0  test1   2000
1  test2  30000

In [8]:
df_2.sort_values('pay', ascending=False)

    name    pay
1  test2  30000
0  test1   2000
2  test3   1000

In [9]:
#copy기능 -> .copy: 해당 데이터 프레임을 복사
df_3 = df_2.copy()
df_3

    name    pay
0  test1   2000
1  test2  30000
2  test3   1000

In [10]:
#drop기능 -> .drop([삭제하고 싶은 column,index],axis=0이나 1) axis=1:열 지정, axis=0: 행 지정
df_4 = df_3.drop(['name'],axis=1)
df_4

df_5 = df_3.drop([0],axis=0)
df_5

    name    pay
1  test2  30000
2  test3   1000

In [14]:
#데이터 프레임의 파일 전환 -> .to_파일 형식('파일명.파일 형식', encoding='utf8'), 디폴트: 현재 작업 폴더 저장(경로 지정:'파일 이름 부분에 정의')
df_5.to_csv('./pand/test.csv', encoding = 'utf8')
df_5.to_csv('../test.csv', encoding = 'utf-8')
#-> ./:현재 폴더 지정 , ../: 상위 폴더 지정